#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/PosTechFiap33/ControlePedido/runs/run-Hckh2AcMPPE3P6pG

Waiting for the plan to start...

Terraform v1.9.6
on linux_amd64
Initializing plugins and modules...
aws_eks_cluster.controle_pedidos_eks: Refreshing state... [id=controle-pedidos-cluster]
aws_eks_node_group.controle_pedido_node_group: Refreshing state... [id=controle-pedidos-cluster:controle-pedido-node-group]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.controle_pedidos will be created
  + resource "helm_release" "controle_pedidos" {
      + atomic                     = false
      + chart                      = "./kubernetes/controlepedidos-chart"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "controle-pedidos"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "externalPosId"
          + value = "SUC001POS001"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "mercadoPagoIntegration.token"
          + value = "QmVhcmVyIEFQUF9VU1ItMjMwODAzNDk5MDEzODI4NS0wNzE2MjEtZDc1MDgyMGIzZTRiMGQzZmJhNGJiZDc3NGE0MTYwMWMtMTg5OTQ2MzY2MQ=="
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "mercadoPagoIntegration.urlWebhook"
            # (2 unchanged attributes hidden)
        }
      + set {
          + name  = "userId"
          + value = "1899463661"
            # (1 unchanged attribute hidden)
        }
    }

  # null_resource.validate_helm_release will be created
  + resource "null_resource" "validate_helm_release" {
      + id = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @FlavioRoberto, Action: `pull_request`*